export const 分隔符 = "$分$";

//#region 用户状态

export enum E事项状态 {
  未开始 = "u未开始",
  // 重复中 = "u重复中",
  // 进行中 = "u进行中",
  已完成 = "u已完成",
}

export enum E事项类型 {
  纪念日 = "u纪念日",
  事项 = "u事项",
}

export enum E提醒 {
  开始时 = "u开始时",
  开始前5分钟 = "u开始前5分钟",
  开始前10分钟 = "u开始前10分钟",
  开始前15分钟 = "u开始前15分钟",
  开始前30分钟 = "u开始前30分钟",
  开始前1小时 = "u开始前1小时",
  开始前2小时 = "u开始前2小时",
  开始前1天 = "u开始前1天",
  开始前3天 = "u开始前3天",
  开始前1周 = "u开始前1周",
  不提醒 = "u不提醒",
}

//#endregion

/** 顶级节点不允许放置其他顶级节点 */
export const 顶级节点 = "$顶级节点";
