export const 分隔符 = "$分$";

//#region 用户状态

export enum E事项状态 {
  未开始 = "u未开始",
  // 重复中 = "u重复中",
  // 进行中 = "u进行中",
  已完成 = "u已完成",
}

export enum E事项类型 {
  纪念日 = "u纪念日",
  事项 = "u事项",
}

export enum E提醒 {
  开始前5分钟 = "u开始前5分钟",
  开始前10分钟 = "u开始前10分钟",
  开始前15分钟 = "u开始前15分钟",
  开始前30分钟 = "u开始前30分钟",
  开始前1小时 = "u开始前1小时",
  开始前2小时 = "u开始前2小时",
  开始前1天 = "u开始前1天",
  开始前3天 = "u开始前3天",
  开始前1周 = "u开始前1周",
  不提醒 = "u不提醒",
}

export function 获取提醒参数(提醒: E提醒): {
  单位: "minute" | "hour" | "day" | "week";
  数量: number;
} {
  const 映射 = {
    [E提醒.开始前5分钟]: { 单位: "minute", 数量: 5 },
    [E提醒.开始前10分钟]: { 单位: "minute", 数量: 10 },
    [E提醒.开始前15分钟]: { 单位: "minute", 数量: 15 },
    [E提醒.开始前30分钟]: { 单位: "minute", 数量: 30 },
    [E提醒.开始前1小时]: { 单位: "hour", 数量: 1 },
    [E提醒.开始前2小时]: { 单位: "hour", 数量: 2 },
    [E提醒.开始前1天]: { 单位: "day", 数量: 1 },
    [E提醒.开始前3天]: { 单位: "day", 数量: 3 },
    [E提醒.开始前1周]: { 单位: "week", 数量: 1 },
  };
  return 映射[提醒];
}

export enum E重复 {
  不重复 = "u不重复",
  每天 = "u每天",
  每周 = "u每周",
  每月 = "u每月",
  每年 = "u每年",
}

//#endregion

/** 顶级节点不允许放置其他顶级节点 */
export const 顶级节点 = "$顶级节点";
